'use strict';

angular.module('trigger')
  .controller('ChatCtrl', function ($scope) {
    $scope.date = new Date();
    $scope.messages = [
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "&gt;Fabeltier ну кто-то принес значит - я не слышах его раньше",
        "t": "2015-01-03T16:04:24.000Z",
        "tid": 304833
      },
      {
        "chid": 1,
        "uid": 1499,
        "uname": "Fabeltier",
        "m": "&gt;Shepherd я и принес, скорее всего. Но скорее в рамках \"Посмотреть, что в старой папке, а то новая уже достала\".",
        "t": "2015-01-03T16:05:00.000Z",
        "tid": 304833
      },
      {
        "chid": 1,
        "uid": 1499,
        "uname": "Fabeltier",
        "m": "&gt;Shepherd но трек хороший, да.",
        "t": "2015-01-03T16:05:07.000Z",
        "tid": 304833
      },
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "&gt;Ucsus с Новым годом!",
        "t": "2015-01-03T16:15:12.000Z",
        "tid": 304834
      },
      {
        "chid": 1,
        "uid": 1897,
        "uname": "VoodooArt",
        "m": "с Новым годом кто-нибудь уже поздравлял?",
        "t": "2015-01-03T17:08:54.000Z",
        "tid": 304843
      },
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "&gt;VoodooArt конечно",
        "t": "2015-01-03T17:09:09.000Z",
        "tid": 304843
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "&gt;VoodooArt Ссссс Новым Годом!",
        "t": "2015-01-03T17:25:39.000Z",
        "tid": 304846
      },
      {
        "chid": 1,
        "uid": 1897,
        "uname": "VoodooArt",
        "m": "&gt;Shepherd &gt;Vakstal с новым годом:)",
        "t": "2015-01-03T17:27:10.000Z",
        "tid": 304846
      },
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "&gt;Vakstal &gt;VoodooArt с новым вдохом",
        "t": "2015-01-03T17:28:13.000Z",
        "tid": 304846
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "Подарили на стимоадм игру, скачал, запустил, а оно вылетает, с... Новым Годом! Обида.",
        "t": "2015-01-03T17:30:06.000Z",
        "tid": 304846
      },
      {
        "chid": 1,
        "uid": 1897,
        "uname": "VoodooArt",
        "m": "&gt;Vakstal другие игры есть, но то что подарили и такой облом - это облом.",
        "t": "2015-01-03T17:33:38.000Z",
        "tid": 304847
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "&gt;VoodooArt это вообще беда. похоже, железячная проблема.",
        "t": "2015-01-03T17:34:35.000Z",
        "tid": 304847
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "&gt;VoodooArt так-то штук шесть или семь подарили, а поиграть могу только в 2д-инди.",
        "t": "2015-01-03T17:34:59.000Z",
        "tid": 304847
      },
      {
        "chid": 1,
        "uid": 1897,
        "uname": "VoodooArt",
        "m": "&gt;Vakstal скачай пиратку для PC^^) и не страдай так",
        "t": "2015-01-03T17:37:00.000Z",
        "tid": 304847
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "&gt;VoodooArt так она ж тоже будет вылетать в белый экран)",
        "t": "2015-01-03T17:37:29.000Z",
        "tid": 304847
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "&gt;VoodooArt сейчас такие времена, что даже на пс4 игры вылетают в главное меню",
        "t": "2015-01-03T17:37:56.000Z",
        "tid": 304847
      },
      {
        "chid": 1,
        "uid": 1897,
        "uname": "VoodooArt",
        "m": "&gt;Vakstal ты просто неправильно что-то делаешь",
        "t": "2015-01-03T17:39:09.000Z",
        "tid": 304848
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "&gt;VoodooArt я тоже так думаю.",
        "t": "2015-01-03T17:39:35.000Z",
        "tid": 304848
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "&gt;VoodooArt но я пока не понял, что.",
        "t": "2015-01-03T17:39:49.000Z",
        "tid": 304848
      },
      {
        "chid": 1,
        "uid": 1924,
        "uname": "Vakstal",
        "m": "&gt;VoodooArt перегрева нет, да и чистил не так давно.",
        "t": "2015-01-03T17:39:57.000Z",
        "tid": 304848
      },
      {
        "chid": 1,
        "uid": 2152,
        "uname": "Pikvusha",
        "m": "всем день или вечер? короче алоха!",
        "t": "2015-01-03T18:01:49.000Z",
        "tid": 304853
      },
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "&gt;Pikvusha приветик",
        "t": "2015-01-03T18:04:11.000Z",
        "tid": 304854
      },
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "&gt;Pikvusha с новым счастьем",
        "t": "2015-01-03T18:04:18.000Z",
        "tid": 304854
      },
      {
        "chid": 1,
        "uid": 2152,
        "uname": "Pikvusha",
        "m": "&gt;Shepherd с наступившим!)",
        "t": "2015-01-03T18:04:30.000Z",
        "tid": 304854
      },
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "&gt;Pikvusha ну всё на сегодня хватит. итого на 5.5 часов сборничек получился :)",
        "t": "2015-01-03T18:25:14.000Z",
        "tid": 304858
      },
      {
        "chid": 1,
        "uid": 2152,
        "uname": "Pikvusha",
        "m": "&gt;Shepherd это хорошо)",
        "t": "2015-01-03T18:28:02.000Z",
        "tid": 304859
      },
      {
        "chid": 1,
        "uid": 2152,
        "uname": "Pikvusha",
        "m": "&gt;Shepherd прямо рабочий день",
        "t": "2015-01-03T18:28:11.000Z",
        "tid": 304859
      },
      {
        "chid": 1,
        "uid": 1562,
        "uname": "XAT",
        "m": "<b>Бодрого вечера, тригганы!</b>",
        "t": "2015-01-03T19:32:41.000Z",
        "tid": 304809
      },
      {
        "chid": 1,
        "uid": 2478,
        "uname": "alinaish",
        "m": "йоу",
        "t": "2015-01-03T19:34:19.000Z",
        "tid": 304805
      },
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "<a href=\"https://pp.vk.me/c424419/v424419065/496d/U8ZESnaZ5G8.jpg\" target=\"_blank\"><img src=\"https://pp.vk.me/c424419/v424419065/496d/U8ZESnaZ5G8.jpg\" /></a>",
        "t": "2015-01-03T19:40:11.000Z",
        "tid": 304806
      },
      {
        "chid": 1,
        "uid": 3,
        "uname": "DoZeR",
        "m": "&gt;Shepherd тут? всё пропустил?",
        "t": "2015-01-03T21:06:13.000Z",
        "tid": 304884
      },
      {
        "chid": 1,
        "uid": 1936,
        "uname": "Ucsus",
        "m": "чо вы тут, виртуалы проклятые?",
        "t": "2015-01-03T21:37:20.000Z",
        "tid": 304889
      },
      {
        "chid": 1,
        "uid": 1562,
        "uname": "XAT",
        "m": "&gt;Ucsus ночи!",
        "t": "2015-01-03T21:37:55.000Z",
        "tid": 304889
      },
      {
        "chid": 1,
        "uid": 1936,
        "uname": "Ucsus",
        "m": "&gt;XAT лайла тов!",
        "t": "2015-01-03T21:38:08.000Z",
        "tid": 304889
      },
      {
        "chid": 1,
        "uid": 959,
        "uname": "russ",
        "m": "&gt;Vakstal ye [jnm rnjnj dcgjvybk",
        "t": "2015-01-03T22:08:39.000Z",
        "tid": 304891
      },
      {
        "chid": 1,
        "uid": 959,
        "uname": "russ",
        "m": "&gt;Vakstal спасибо, братюнь",
        "t": "2015-01-03T22:09:03.000Z",
        "tid": 304891
      },
      {
        "chid": 1,
        "uid": 2473,
        "uname": "llikd",
        "m": "о, именинник :)",
        "t": "2015-01-03T22:09:52.000Z",
        "tid": 304891
      },
      {
        "chid": 1,
        "uid": 2473,
        "uname": "llikd",
        "m": "с днюхой, до 120-ти тебе ;)",
        "t": "2015-01-03T22:10:13.000Z",
        "tid": 304891
      },
      {
        "chid": 1,
        "uid": 959,
        "uname": "russ",
        "m": "&gt;llikd спасибо",
        "t": "2015-01-03T22:12:06.000Z",
        "tid": 304891
      },
      {
        "chid": 1,
        "uid": 959,
        "uname": "russ",
        "m": "я же могу раз в году сделать хуйню?",
        "t": "2015-01-03T22:19:39.000Z",
        "tid": 304892
      },
      {
        "chid": 1,
        "uid": 2473,
        "uname": "llikd",
        "m": "хм, спящий малой этот трек не оценил...",
        "t": "2015-01-03T22:26:33.000Z",
        "tid": 304896
      },
      {
        "chid": 1,
        "uid": 959,
        "uname": "russ",
        "m": "&gt;llikd ящетаю это прекрасный трек",
        "t": "2015-01-03T22:27:47.000Z",
        "tid": 304896
      },
      {
        "chid": 1,
        "uid": 2473,
        "uname": "llikd",
        "m": "малому далеко еще до таких треков :)",
        "t": "2015-01-03T22:30:28.000Z",
        "tid": 304894
      },
      {
        "chid": 1,
        "uid": 3,
        "uname": "DoZeR",
        "m": "&gt;llikd приятное музло",
        "t": "2015-01-03T23:01:01.000Z",
        "tid": 304900
      },
      {
        "chid": 1,
        "uid": 3,
        "uname": "DoZeR",
        "m": "&gt;llikd долго льется",
        "t": "2015-01-03T23:19:11.000Z",
        "tid": 304900
      },
      {
        "chid": 1,
        "uid": 2043,
        "uname": "Shepherd",
        "m": "&gt;DoZeR пропустиль :(",
        "t": "2015-01-04T04:48:05.000Z",
        "tid": 304902
      },
      {
        "chid": 1,
        "uid": 1520,
        "uname": "kpya3e",
        "m": "утро!",
        "t": "2015-01-04T07:50:50.000Z",
        "tid": 304902
      },
      {
        "chid": 1,
        "uid": 3,
        "uname": "DoZeR",
        "m": "боброе!",
        "t": "2015-01-04T08:08:39.000Z",
        "tid": 304902
      },
      {
        "chid": 1,
        "uid": 3,
        "uname": "DoZeR",
        "m": "&gt;Shepherd сохранил треклист страницей хистори и выборочно прослушал через поиск вк",
        "t": "2015-01-04T08:10:09.000Z",
        "tid": 304902
      },
      {
        "chid": 1,
        "uid": 3,
        "uname": "DoZeR",
        "m": "&gt;Shepherd не расстраивайся)",
        "t": "2015-01-04T08:10:30.000Z",
        "tid": 304902
      },
      {
        "m": "привет всем",
        "uid": 2215,
        "uname": "Bigi",
        "chid": 1,
        "tid": 304902,
        "t": "2015-01-04T08:11:42.120Z"
      },
      {
        "m": "&gt;russ <b>С днем рождения дорогой!!!</b>",
        "uid": 2438,
        "uname": "VelikoeKote",
        "chid": 1,
        "tid": 304904,
        "t": "2015-01-04T08:28:03.406Z"
      },
      {
        "m": "&gt;VelikoeKote cgfcb,j? pfz)",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304904,
        "t": "2015-01-04T08:28:17.701Z"
      },
      {
        "m": "&gt;VelikoeKote Спасибо, зая)",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304904,
        "t": "2015-01-04T08:28:24.653Z"
      },
      {
        "m": "Всем привет",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304904,
        "t": "2015-01-04T08:28:46.301Z"
      },
      {
        "m": "<a href=\"https://pp.vk.me/c622025/v622025316/1212b/G_dIjCb4tzE.jpg\" target=\"_blank\"><img src=\"https://pp.vk.me/c622025/v622025316/1212b/G_dIjCb4tzE.jpg\" /></a>",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304906,
        "t": "2015-01-04T08:39:44.424Z"
      },
      {
        "m": "МНЕ АДМ ПОДАРОК ПОДАРИЛ!!!",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304907,
        "t": "2015-01-04T08:45:42.952Z"
      },
      {
        "m": "спустя 4 года лол",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304907,
        "t": "2015-01-04T08:47:57.261Z"
      },
      {
        "m": "<a href=\"http://std3.ru/31/6b/1408183245-316bd0c5a01d34116e982e84825436a5.jpeg\" target=\"_blank\"><img src=\"http://std3.ru/31/6b/1408183245-316bd0c5a01d34116e982e84825436a5.jpeg\" /></a>",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304907,
        "t": "2015-01-04T08:49:58.419Z"
      },
      {
        "m": "&gt;samlopata &gt;S0ulTr4d3r &gt;stiff &gt;Ucsus &gt;llikd &gt;DoZeR &gt;Nofets &gt;VelikoeKote &gt;sinestetik &gt;kpya3e &gt;EveryonE &gt;Rockhaunt &gt;Bigi &gt;si14 &gt;JohnBo &gt;Gans ну тащите музяку жеж",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304908,
        "t": "2015-01-04T08:50:59.434Z"
      },
      {
        "m": "&gt;russ че где",
        "uid": 1975,
        "uname": "JohnBo",
        "chid": 1,
        "tid": 304908,
        "t": "2015-01-04T08:51:12.211Z"
      },
      {
        "m": "приветы",
        "uid": 1975,
        "uname": "JohnBo",
        "chid": 1,
        "tid": 304908,
        "t": "2015-01-04T08:51:14.632Z"
      },
      {
        "m": "&gt;JohnBo дарова",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304908,
        "t": "2015-01-04T08:51:21.032Z"
      },
      {
        "m": "Я в этой волне не особо секу, но вот че то прнс",
        "uid": 1975,
        "uname": "JohnBo",
        "chid": 1,
        "tid": 304909,
        "t": "2015-01-04T09:04:33.766Z"
      },
      {
        "m": "я на работе, тут музла почти нет... так что, чукча до вечера не писатель :)",
        "uid": 2473,
        "uname": "llikd",
        "chid": 1,
        "tid": 304910,
        "t": "2015-01-04T09:08:50.967Z"
      },
      {
        "m": "точно не антвуд",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304912,
        "t": "2015-01-04T09:19:01.062Z"
      },
      {
        "m": "микс шоли?",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304912,
        "t": "2015-01-04T09:19:40.718Z"
      },
      {
        "m": "смысл выкладывать в таком говёном качестве?",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:38:43.846Z"
      },
      {
        "m": "это ж продижды, уважать надо",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:38:56.110Z"
      },
      {
        "m": "&gt;VelikoeKote хуже качества не было?",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:41:17.389Z"
      },
      {
        "m": "&gt;russ ишь раскомандовался",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:41:35.443Z"
      },
      {
        "m": "ты посмотри на них)",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:41:40.097Z"
      },
      {
        "m": "&gt;DoZeR судя повсему запись из зала",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:41:42.479Z"
      },
      {
        "m": "&gt;VelikoeKote &gt;kadettt танунах такое слушать",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:41:58.737Z"
      },
      {
        "m": "&gt;DoZeR угу",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:42:05.783Z"
      },
      {
        "m": "&gt;DoZeR притому  них на концертах звук  хороший",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304916,
        "t": "2015-01-04T09:42:22.529Z"
      },
      {
        "m": "&gt;DoZeR у него днюха,вот и камандует",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:43:38.088Z"
      },
      {
        "m": "&gt;kadettt да слил я тот трек",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:43:54.161Z"
      },
      {
        "m": "&gt;kadettt узбагойтесь",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:44:00.464Z"
      },
      {
        "m": "&gt;kadettt могу и этот слить",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:44:18.511Z"
      },
      {
        "m": "амбиции",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:44:46.403Z"
      },
      {
        "m": "лан я пошел в лол играть, как заебет пишите",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:45:34.879Z"
      },
      {
        "m": "nbymrfqnt dcvsckt",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:51:25.985Z"
      },
      {
        "m": "тинькайте",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:51:33.193Z"
      },
      {
        "m": "моя свалил",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:51:38.997Z"
      },
      {
        "m": "чо такое лол ?",
        "uid": 498,
        "uname": "kadettt",
        "chid": 1,
        "tid": 304917,
        "t": "2015-01-04T09:52:12.929Z"
      },
      {
        "m": "&gt;kadettt лига легенд",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304925,
        "t": "2015-01-04T10:58:58.924Z"
      },
      {
        "m": "у меня дежавю",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304926,
        "t": "2015-01-04T10:59:23.543Z"
      },
      {
        "m": "&gt;VelikoeKote тут ?",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304929,
        "t": "2015-01-04T11:11:10.696Z"
      },
      {
        "m": "JohnBo, тут?",
        "uid": 2415,
        "uname": "fancar",
        "chid": 1,
        "tid": 304955,
        "t": "2015-01-04T12:35:15.566Z"
      },
      {
        "m": "какой годный музон играет, ну вообще",
        "uid": 788,
        "uname": "afanasiy_rosha",
        "chid": 1,
        "tid": 304958,
        "t": "2015-01-04T12:54:14.176Z"
      },
      {
        "m": "&gt;fancar тут",
        "uid": 1975,
        "uname": "JohnBo",
        "chid": 1,
        "tid": 304973,
        "t": "2015-01-04T15:03:45.021Z"
      },
      {
        "m": "ping",
        "uid": 3,
        "uname": "DoZeR",
        "chid": 1,
        "tid": 304975,
        "t": "2015-01-04T15:14:20.615Z"
      },
      {
        "m": "бу!",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304985,
        "t": "2015-01-04T17:41:10.936Z"
      },
      {
        "m": "алоха!",
        "uid": 2152,
        "uname": "Pikvusha",
        "chid": 1,
        "tid": 304989,
        "t": "2015-01-04T18:09:51.713Z"
      },
      {
        "m": "&gt;Pikvusha Привет.",
        "uid": 2446,
        "uname": "true",
        "chid": 1,
        "tid": 304995,
        "t": "2015-01-04T18:53:05.685Z"
      },
      {
        "m": "как у нас тут все минималистично мертво",
        "uid": 703,
        "uname": "audioburglar",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:29:35.796Z"
      },
      {
        "m": "местами - переменная облачность, возможны осадки",
        "uid": 2473,
        "uname": "llikd",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:44:15.350Z"
      },
      {
        "m": "/ххх",
        "uid": 2473,
        "uname": "llikd",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:44:58.329Z"
      },
      {
        "m": "&gt;russ хола! с ДР! <s>котов и енотов!</s> всех благ!",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:50:51.822Z"
      },
      {
        "m": "&gt;XAT Спасибо дорогой",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:51:25.798Z"
      },
      {
        "m": "&gt;XAT я не успеваю всем отвечать",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:51:41.974Z"
      },
      {
        "m": "&gt;russ ))",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:51:57.321Z"
      },
      {
        "m": "&gt;XAT у меня телефон разрывается, звонят через каждую минуту",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:52:43.333Z"
      },
      {
        "m": "&gt;russ збс, чо) скажи им чтоб по очереди звонили. с перерывом в 5-7 минут, чтоб успевать тосты слушать)",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:54:49.039Z"
      },
      {
        "m": "&gt;XAT чоты вы запустили триггер",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:57:36.687Z"
      },
      {
        "m": "&gt;DoZeR не клей мою девушку",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T19:58:49.277Z"
      },
      {
        "m": "&gt;russ <span class=\"irony\">триггер запущен. всё работает.</span>",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T20:02:48.900Z"
      },
      {
        "m": "&gt;XAT ща я исправю ситуацию",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304996,
        "t": "2015-01-04T20:03:27.176Z"
      },
      {
        "m": "держите еще треков",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:16:35.949Z"
      },
      {
        "m": "ну мне же можног, да",
        "uid": 959,
        "uname": "russ",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:25:17.086Z"
      },
      {
        "m": "&gt;russ ещё полчаса можно, а потом спать!",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:29:19.499Z"
      },
      {
        "m": "&gt;Vakstal ты строк",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:06.619Z"
      },
      {
        "m": "&gt;Vakstal шалом, таксистам!",
        "uid": 1936,
        "uname": "Ucsus",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:13.383Z"
      },
      {
        "m": "&gt;XAT ну завтра ж понедельник, ХАТ!",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:18.868Z"
      },
      {
        "m": "&gt;Ucsus привет, а запятая зачем?",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:29.124Z"
      },
      {
        "m": "&gt;Vakstal я сегодня в ужасе узнал, что сегодня вскр",
        "uid": 1936,
        "uname": "Ucsus",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:38.652Z"
      },
      {
        "m": "&gt;Vakstal Vakstal!",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:39.650Z"
      },
      {
        "m": "&gt;Vakstal случайно",
        "uid": 1936,
        "uname": "Ucsus",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:42.787Z"
      },
      {
        "m": "&gt;Ucsus жуть какая",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:44.952Z"
      },
      {
        "m": "&gt;Vakstal с того года завалялась",
        "uid": 1936,
        "uname": "Ucsus",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:47.236Z"
      },
      {
        "m": "&gt;Vakstal какой понедельник??",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:31:56.375Z"
      },
      {
        "m": "&gt;XAT у Уксуса спроси",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:32:04.322Z"
      },
      {
        "m": "&gt;Ucsus какой понедельник то?",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:32:41.170Z"
      },
      {
        "m": "&gt;XAT хуевый",
        "uid": 1936,
        "uname": "Ucsus",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:32:50.711Z"
      },
      {
        "m": "вооооот",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:34:30.732Z"
      },
      {
        "m": "&gt;Vakstal о как... а чо, у, таксистов, тоже понедельник завтра?",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:36:26.822Z"
      },
      {
        "m": "&gt;XAT я думаю, таксистам удобнее работать два через два. даже не знаю, есть ли у них стандартная пятидневка",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:37:00.152Z"
      },
      {
        "m": "&gt;Vakstal мошт только нестандартная. хз. вы, такситсты, такие загадочные)",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:39:29.587Z"
      },
      {
        "m": "&gt;XAT ага, и не говори.",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:39:38.853Z"
      },
      {
        "m": "&gt;XAT но у меня выходные ещё будут до 11",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:39:53.726Z"
      },
      {
        "m": "&gt;XAT потом пять рабочих и отпуск до 01.02",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:40:03.371Z"
      },
      {
        "m": "&gt;Vakstal так уже 11.40. опаздываешь",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:40:11.324Z"
      },
      {
        "m": "&gt;XAT а я уже не знаю, чем занятьс",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:40:16.792Z"
      },
      {
        "m": "&gt;Vakstal в отпуске?",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:40:37.443Z"
      },
      {
        "m": "&gt;XAT не, ты не путай, 11, а не 23",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:40:44.097Z"
      },
      {
        "m": "&gt;XAT в отпуске. сейчас-то просто выходные, а потом ещё две недели отпуск",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:41:01.401Z"
      },
      {
        "m": "&gt;Vakstal нахер ты взял отпуск после новогодних? печень полечить?) так ты ж не пйож.",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:41:34.976Z"
      },
      {
        "m": "&gt;XAT так кто ж знал, что мне дадут аж 11 выходных",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:42:03.759Z"
      },
      {
        "m": "&gt;XAT я себе расставил отпуск равномерно на весь год",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:42:20.629Z"
      },
      {
        "m": "&gt;Vakstal ааааа, тебя выпиздили в принудительный чтоли?",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:42:25.573Z"
      },
      {
        "m": "&gt;XAT а они оп и выходных напихали",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:42:25.804Z"
      },
      {
        "m": "&gt;XAT &gt;Vakstal привет.",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:43:12.371Z"
      },
      {
        "m": "&gt;boocha о, привет.",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:43:19.435Z"
      },
      {
        "m": "&gt;XAT &gt;Vakstal быстро советуйте клевый ужастик!",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:43:25.743Z"
      },
      {
        "m": "&gt;boocha вечера)",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:43:28.655Z"
      },
      {
        "m": "&gt;XAT &gt;Vakstal чтобы прям обосаца",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:43:33.279Z"
      },
      {
        "m": "&gt;boocha оно",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:43:36.971Z"
      },
      {
        "m": "&gt;boocha бабадук!",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:43:52.653Z"
      },
      {
        "m": "хз, я ужастиков не знаю",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:44:04.492Z"
      },
      {
        "m": "&gt;boocha не только обосаца",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:44:21.161Z"
      },
      {
        "m": "но у меня просто требования дебильные)",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:44:31.518Z"
      },
      {
        "m": "поновее и с озвучкой хорошей",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:45:24.011Z"
      },
      {
        "m": "if it's in a word <br> or it's in a look <br> you can't get rid of <br> <big><b>THE BABADOOK!</b></big>",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:46:41.469Z"
      },
      {
        "m": "&gt;boocha атсрал",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:48:24.739Z"
      },
      {
        "m": "&gt;boocha астрал, т.е.",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:48:32.583Z"
      },
      {
        "m": "&gt;XAT атсрал смотрела",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:48:39.159Z"
      },
      {
        "m": "&gt;boocha а этот, как его",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:48:44.911Z"
      },
      {
        "m": "&gt;boocha окулюсь",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:48:46.460Z"
      },
      {
        "m": "&gt;Vakstal чоа?",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:48:53.623Z"
      },
      {
        "m": "&gt;boocha ну во <a href=\"http://www.kinopoisk.ru/film/680499/\" target=\"_blank\">http://www.kinopoisk.ru/film/680499/</a>",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:49:12.945Z"
      },
      {
        "m": "&gt;Vakstal я уже нашла, уиии, нормально)",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:49:30.212Z"
      },
      {
        "m": "&gt;Vakstal только на вочизе отзывы - хз",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:49:37.717Z"
      },
      {
        "m": "&gt;boocha да и оценки",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:49:43.986Z"
      },
      {
        "m": "&gt;Vakstal а ты как считаешь?",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:50:03.224Z"
      },
      {
        "m": "&gt;boocha а я считаю, что если нравится жанр, то надо попробовать",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:50:24.803Z"
      },
      {
        "m": "&gt;Vakstal ты прямо как сексопатолог говоришь)",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:50:42.810Z"
      },
      {
        "m": "&gt;Vakstal спасибоньки!",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:50:49.499Z"
      },
      {
        "m": "&gt;XAT может, и не таксист вовсе, а сексопатолог!",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:51:02.849Z"
      },
      {
        "m": "&gt;Vakstal мошт и таксист-сексопатолог) лишь бы не сексопатологоанатом)",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:52:00.961Z"
      },
      {
        "m": "&gt;XAT таксист-сексист!",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:52:30.161Z"
      },
      {
        "m": "&gt;Vakstal таксолог",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:53:21.673Z"
      },
      {
        "m": "&gt;XAT это что-то про такс",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:53:30.025Z"
      },
      {
        "m": "&gt;XAT узкоспециализированный такой кинолог",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:53:43.630Z"
      },
      {
        "m": "&gt;Vakstal таксофил - вот это про такс",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:53:57.740Z"
      },
      {
        "m": "&gt;XAT это уже не очень здраво",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:54:11.136Z"
      },
      {
        "m": "&gt;Vakstal узкоспециализированный - таксовод)",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:54:26.206Z"
      },
      {
        "m": "&gt;XAT вод - это если развожу, разве нет?",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:54:49.946Z"
      },
      {
        "m": "&gt;Vakstal заводишь",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T20:56:02.322Z"
      },
      {
        "m": "кс-кс-кс, ап-ап-ап",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:03:38.371Z"
      },
      {
        "m": "&gt;Vakstal &gt;XAT ну кому я кыскаю?",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:04:10.444Z"
      },
      {
        "m": "&gt;boocha так надо тинькать, а не кыскать",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:04:30.003Z"
      },
      {
        "m": "там такие уииии запилы!",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:04:34.358Z"
      },
      {
        "m": "&gt;boocha не слышно же ж",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:04:36.223Z"
      },
      {
        "m": "&gt;Ucsus ало!",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:04:47.271Z"
      },
      {
        "m": "&gt;boocha могу в тапок насцать)",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:04:56.793Z"
      },
      {
        "m": "&gt;Ucsus аа-лло!",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:04:59.778Z"
      },
      {
        "m": "&gt;boocha шалом, дарлинг!",
        "uid": 1936,
        "uname": "Ucsus",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:05:09.261Z"
      },
      {
        "m": "&gt;boocha ХАТ может",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:05:23.669Z"
      },
      {
        "m": "&gt;boocha русса потереби.",
        "uid": 1562,
        "uname": "XAT",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:05:36.557Z"
      },
      {
        "m": "&gt;XAT вот давай только без этого!",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:05:50.187Z"
      },
      {
        "m": "&gt;russ рус, а рус?",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:05:57.973Z"
      },
      {
        "m": "нормас",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:06:24.114Z"
      },
      {
        "m": "&gt;boocha вот, кстати, ты тут кыскала, а у нас тут водится ВеликоеКоте - и не реагирует",
        "uid": 1924,
        "uname": "Vakstal",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:07:24.088Z"
      },
      {
        "m": "&gt;Vakstal я на то и кыскала",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 304997,
        "t": "2015-01-04T21:07:37.117Z"
      },
      {
        "m": "чего у вас тут?",
        "uid": 271,
        "uname": "thorgnir",
        "chid": 1,
        "tid": 305011,
        "t": "2015-01-04T21:13:52.619Z"
      },
      {
        "m": "&gt;thorgnir у руса др",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 305011,
        "t": "2015-01-04T21:14:02.389Z"
      },
      {
        "m": "&gt;thorgnir а так-кладбище",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 305011,
        "t": "2015-01-04T21:14:10.518Z"
      },
      {
        "m": "&gt;boocha ну кладбище это ожидаемо на выходных-то",
        "uid": 271,
        "uname": "thorgnir",
        "chid": 1,
        "tid": 305011,
        "t": "2015-01-04T21:14:33.433Z"
      },
      {
        "m": "&gt;thorgnir да тут по-моему всегда теперь кладбище",
        "uid": 1155,
        "uname": "boocha",
        "chid": 1,
        "tid": 305011,
        "t": "2015-01-04T21:14:53.270Z"
      },
      {
        "m": "&gt;boocha возможно. я так, последнее время заглядываю проверить, работает ли вообще ) хотя обычно проверяю по синей лампочке на серваке",
        "uid": 271,
        "uname": "thorgnir",
        "chid": 1,
        "tid": 305011,
        "t": "2015-01-04T21:15:39.394Z"
      },
      {
        "m": "Фаб незримо присутствует )",
        "uid": 271,
        "uname": "thorgnir",
        "chid": 1,
        "tid": 305000,
        "t": "2015-01-04T21:22:42.559Z"
      },
      {
        "m": "Я не незримо, тут часовой сет от меня буквально недавно играл ))",
        "uid": 1499,
        "uname": "Fabeltier",
        "chid": 1,
        "tid": 304998,
        "t": "2015-01-04T21:24:30.954Z"
      },
      {
        "m": "&gt;Fabeltier а я только пришел, напившись пива",
        "uid": 271,
        "uname": "thorgnir",
        "chid": 1,
        "tid": 304998,
        "t": "2015-01-04T21:24:50.621Z"
      }
    ];
  });
